; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-2)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	)
(:init
	(at plane1 city6)
	(= (capacity plane1) 11765)
	(= (fuel plane1) 2298)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 10)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 6)
	(at person1 city0)
	(at person2 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 863)
	(= (distance city0 city2) 742)
	(= (distance city0 city3) 971)
	(= (distance city0 city4) 672)
	(= (distance city0 city5) 731)
	(= (distance city0 city6) 778)
	(= (distance city1 city0) 863)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 640)
	(= (distance city1 city3) 631)
	(= (distance city1 city4) 750)
	(= (distance city1 city5) 960)
	(= (distance city1 city6) 844)
	(= (distance city2 city0) 742)
	(= (distance city2 city1) 640)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 596)
	(= (distance city2 city4) 849)
	(= (distance city2 city5) 578)
	(= (distance city2 city6) 885)
	(= (distance city3 city0) 971)
	(= (distance city3 city1) 631)
	(= (distance city3 city2) 596)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 517)
	(= (distance city3 city5) 569)
	(= (distance city3 city6) 767)
	(= (distance city4 city0) 672)
	(= (distance city4 city1) 750)
	(= (distance city4 city2) 849)
	(= (distance city4 city3) 517)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 950)
	(= (distance city4 city6) 588)
	(= (distance city5 city0) 731)
	(= (distance city5 city1) 960)
	(= (distance city5 city2) 578)
	(= (distance city5 city3) 569)
	(= (distance city5 city4) 950)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 807)
	(= (distance city6 city0) 778)
	(= (distance city6 city1) 844)
	(= (distance city6 city2) 885)
	(= (distance city6 city3) 767)
	(= (distance city6 city4) 588)
	(= (distance city6 city5) 807)
	(= (distance city6 city6) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city4)
	(at person1 city3)
	(at person2 city0)
	))

(:metric minimize (+ (* 3 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (refuel plane1 city6)
   changed: (fuel plane1) from 2298 to 11765
   goals met: 0 of 3
2. (fly plane1 city6 city4)
   deleted: (at plane1 city6)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 0 to 2940, (fuel plane1) from 11765 to 8825
   goals met: 1 of 3
3. (board person2 plane1 city4)
   deleted: (at person2 city4)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 3
4. (fly plane1 city4 city0)
   deleted: (at plane1 city4)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 2940 to 6300, (fuel plane1) from 8825 to 5465
   goals met: 0 of 3
5. (debark person2 plane1 city0)
   deleted: (in person2 plane1)
   added: (at person2 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 1 of 3
6. (board person1 plane1 city0)
   deleted: (at person1 city0)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 3
7. (fly plane1 city0 city4)
   deleted: (at plane1 city0)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 6300 to 9660, (fuel plane1) from 5465 to 2105
   goals met: 2 of 3
8. (refuel plane1 city4)
   changed: (fuel plane1) from 2105 to 11765
   goals met: 2 of 3
9. (fly plane1 city4 city3)
   deleted: (at plane1 city4)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 9660 to 12245, (fuel plane1) from 11765 to 9180
   goals met: 1 of 3
10. (debark person1 plane1 city3)
   deleted: (in person1 plane1)
   added: (at person1 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 3
11. (fly plane1 city3 city4)
   deleted: (at plane1 city3)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 12245 to 14830, (fuel plane1) from 9180 to 6595
   goals met: 3 of 3
